Reports/ОтчетОплатыМВК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>ОтчетОплатыМВК</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Результат</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Documents/ОплатаУслугМВК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ОплатаУслугМВК</Name>
			<Comment>Прийняття оплати за надані послуги по Миргородводоканал</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоЛьготам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоСубсидиям</xr:Item>
				<xr:Item>InformationRegister.ПоказанияПриборовУчета</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЛицевымСчетам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоРегиональнымСубсидиям</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПоступлениеНаСчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Потребитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПлатежа</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакАванса</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ОтчетОплатыМВК/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ВыбратьДанныеНаСервере1(ТабДок)
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Даний фрагмент побудований конструктором.
	// При повторному використанні конструктора, внесені вручну зміни будуть втрачені!!!
	
	Макет = Отчеты.ОтчетОплатыМВК.ПолучитьМакет("Макет");
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.Ссылка,
		|	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.Представление,
		|	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.БанковскийСчет,
		|	ПРЕДСТАВЛЕНИЕ(ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.БанковскийСчет),
		|	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.ЛицевойСчет,
		|	ПРЕДСТАВЛЕНИЕ(ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.ЛицевойСчет),
		|	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.СуммаПлатежа КАК СуммаПлатежа,
		|	СУММА(ОплатаУслугМВКРасшифровкаПлатежа.Сумма) КАК Сумма
		|ИЗ
		|	Документ.ОплатаУслугМВК.РасшифровкаПлатежа КАК ОплатаУслугМВКРасшифровкаПлатежа
		|ГДЕ
		|	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачПериода И &КонПериода
		|	И ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.Ссылка,
		|	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.Представление,
		|	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.БанковскийСчет,
		|	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.ЛицевойСчет,
		|	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.СуммаПлатежа";
	
	Запрос.УстановитьПараметр("КонПериода", КонецДня(Отчет.КонПериода));
	Запрос.УстановитьПараметр("НачПериода", Отчет.НачПериода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.Сумма <> ВыборкаДетальныеЗаписи.СуммаПлатежа ИЛИ ВыборкаДетальныеЗаписи.Сумма = 0 Тогда
		    ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		    ТабДок.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
		КонецЕсли;
	КонецЦикла;
	
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры

&НаСервере
Процедура ВыбратьДанныеНаСервере(ТабДок)
	Макет = Отчеты.ОтчетОплатыМВК.ПолучитьМакет("Макет");
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.Ссылка КАК Ссылка,
	    |	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.БанковскийСчет КАК БанковскийСчет,
	    |	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.ЛицевойСчет КАК ЛицевойСчет,
	    |	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.СуммаПлатежа КАК СуммаПлатежа,
	    |	СУММА(ОплатаУслугМВКРасшифровкаПлатежа.Сумма) КАК Сумма,
	    |	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.Номер
	    |ИЗ
	    |	Документ.ОплатаУслугМВК.РасшифровкаПлатежа КАК ОплатаУслугМВКРасшифровкаПлатежа
	    |ГДЕ
	    |	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.Дата МЕЖДУ &НачПериода И &КонПериода
	    |	И ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.Проведен = ИСТИНА
	    |
	    |СГРУППИРОВАТЬ ПО
	    |	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.ЛицевойСчет,
	    |	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.Ссылка,
	    |	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.БанковскийСчет,
	    |	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.СуммаПлатежа,
	    |	ОплатаУслугМВКРасшифровкаПлатежа.Ссылка.Номер";
	Запрос.УстановитьПараметр("НачПериода", Отчет.НачПериода);
	Запрос.УстановитьПараметр("КонПериода", КонецДня(Отчет.КонПериода));
	Результат = Запрос.Выполнить().Выгрузить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	Для Каждого стр Из Результат Цикл
		Док = стр.Ссылка.ПолучитьОбъект();
		Если Док.РасшифровкаПлатежа.Количество() = 0 ИЛИ стр.СуммаПлатежа <> стр.Сумма Тогда
			ОбластьДетальныхЗаписей.Параметры.Представление = стр.Ссылка;
			ОбластьДетальныхЗаписей.Параметры.БанковскийСчетПредставление = стр.БанковскийСчет;
			ОбластьДетальныхЗаписей.Параметры.ЛицевойСчетПредставление = стр.ЛицевойСчет;
			ОбластьДетальныхЗаписей.Параметры.СуммаПлатежа = стр.СуммаПлатежа;
			ОбластьДетальныхЗаписей.Параметры.Сумма = стр.Сумма;
			ОбластьДетальныхЗаписей.Параметры.Номер = стр.Номер;
			ТабДок.Вывести(ОбластьДетальныхЗаписей);
		КонецЕсли;
	КонецЦикла;
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДанные(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ВыбратьДанныеНаСервере(ТабДок);
	ТабДок.Показать();
КонецПроцедуры

&НаСервере
Процедура ПустаяТабЧастьНаСервере(ТабДок)
	Макет = Отчеты.ОтчетОплатыМВК.ПолучитьМакет("Макет");
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ОплатаУслугМВК.Ссылка,
	    |	ОплатаУслугМВК.Номер
	    |ИЗ
	    |	Документ.ОплатаУслугМВК КАК ОплатаУслугМВК
	    |ГДЕ
	    |	ОплатаУслугМВК.Дата МЕЖДУ &НачПериода И &КонПериода
	    |	И ОплатаУслугМВК.Проведен = ИСТИНА";
	Запрос.УстановитьПараметр("НачПериода", Отчет.НачПериода);
	Запрос.УстановитьПараметр("КонПериода", КонецДня(Отчет.КонПериода));
	Результат = Запрос.Выполнить().Выгрузить();
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
	ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
	
	ТабДок.Очистить();
	ТабДок.Вывести(ОбластьЗаголовок);
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ТабДок.НачатьАвтогруппировкуСтрок();
	
	Для Каждого стр Из Результат Цикл
		Док = стр.Ссылка.ПолучитьОбъект();
		Если Док.РасшифровкаПлатежа.Количество() = 0 Тогда
			ОбластьДетальныхЗаписей.Параметры.Представление = стр.Ссылка;
			ОбластьДетальныхЗаписей.Параметры.Номер = стр.Номер;
			ТабДок.Вывести(ОбластьДетальныхЗаписей);
		КонецЕсли;
	КонецЦикла;
	ТабДок.ЗакончитьАвтогруппировкуСтрок();
	ТабДок.Вывести(ОбластьПодвалТаблицы);
	ТабДок.Вывести(ОбластьПодвал);
КонецПроцедуры

&НаКлиенте
Процедура ПустаяТабЧасть(Команда)
	ТабДок = Новый ТабличныйДокумент;
	ПустаяТабЧастьНаСервере(ТабДок);
	ТабДок.Показать();
КонецПроцедуры
